shercliff/baseCase/Fico_epotFoamBuoyant/PETSc_Hypre_BoomerAMG/strongScaling_640k/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2212                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     epotFoamBuoyant; 

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         2;

deltaT          0.02;

writeControl    runTime;

writeInterval   2;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable yes;

adjustTimeStep  off;

functions
{
  #includeFunc components(U)
}

libs            (petscFoam);

// ************************************************************************* //
