shercliff/baseCase/Fico_epotFoamBuoyant/PETSc_Hypre_BoomerAMG/strongScaling_640k/constant/fvOptions
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2212                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
  version     2.0;
  format      ascii;
  class       dictionary;
  object      fvOptions;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

fixedTemperature
{
  type            scalarFixedValueConstraint;
  
  selectionMode   all;

  fieldValues
  {
	  T	1;
  }
}

// ************************************************************************* //
