shercliff/baseCase/Fico_epotFoamBuoyant/PETSc_Hypre_BoomerAMG/strongScaling_640k/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2212                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
  version     2.0;
  format      ascii;
  class       dictionary;
  object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

transportModel Newtonian;

TRef            TRef [0 0 0 1 0 0 0] 1;

nu              nu [0 2 -1 0 0 0 0] 1;

rho             rho [1 -3 0 0 0 0 0] 1;

cp              Cp [0 2 -2 -1 0 0 0] 1;

beta            beta [0 0 0 -1 0 0 0] 0.0001; // doesn't matter since T is held constant

Pr             Pr [0 0 0 0 0 0 0] 1; 

Prt             Prt [0 0 0 0 0 0 0] 1; 

// ************************************************************************* //
