shercliff/baseCase/Fico_epotFoamBuoyant/PETSc_Hypre_BoomerAMG/strongScaling_640k/0/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2212                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
  version     2.0;
  format      ascii;
  class       volScalarField;
  location    "0";
  object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 0 0 1 0 0 0 ];

internalField   uniform 1;

boundaryField
{
  bottom
  {
    type              fixedValue;
    value             uniform 1;
  }
  top
  {
    type              fixedValue;
    value             uniform 1;
  }
  outlet
  {
    type            fixedValue;
    value           uniform 1;
  }
  inlet
  {
    type            fixedValue;
    value           uniform 1;
  }
  sides
  {
    type            fixedValue;
    value           uniform 1;
  }
}


// ************************************************************************* //
