shercliff/baseCase/Fico_epotFoamBuoyant/PETSc_Hypre_BoomerAMG/strongScaling_640k/0/sigma
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2212                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
  version     2.0;
  format      ascii;
  class       volScalarField;
  location    "0";
  object      sigma;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ -1 -3 3 0 0 2 0 ];

sigma           1;
internalField   uniform $sigma;

boundaryField
{
  outlet
  {
    type            zeroGradient;
  }
  inlet
  {
    type            zeroGradient;
  }
  bottom
  {
    type            fixedValue;
    value           uniform $sigma;
  }
  top
  {
    type            fixedValue;
    value           uniform $sigma;
  }
  sides
  {
    type            fixedValue;
    value           uniform $sigma;
  }
}


// ************************************************************************* //
